<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Faq;

class FaqSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $faqs = [
            [
                'question' => 'طرق الدفع على الموقع ايه ؟',
                'answer' => 'الدفع عن طريق فوري باي
بعد ما تطلب الاوردر وتضغط على السلة وتضغط إتمام عملية الدفع

بتملي بياناتك وتضغط على علامة فوري ، هيجيلك كود مرجعي تدفع بيه من اي محل فيه ماكينة فوري',
                'order' => 1,
                'status' => 'active'
            ],
            [
                'question' => 'لازم انزل ادفع بالكود على طول ؟',
                'answer' => 'الكود صلاحيته ٤ ساعات فقط بعدها الطلب بتاعك بيتلغي تلقائيا',
                'order' => 2,
                'status' => 'active'
            ],
            [
                'question' => 'مدة التوصيل قد ايه ؟',
                'answer' => 'التوصيل بيكون خلال 3 ل 5 ايام عمل
مع العلم أن الجمعة والسبت إجازة رسمية لدي البريد المصري

متوسط وصول الشحنة (يومين) حسب المحافظة',
                'order' => 3,
                'status' => 'active'
            ],
            [
                'question' => 'هستلم الكتاب منين وازاي ؟',
                'answer' => 'لو طلبت شحن عادى بيجيلك لحد اقرب مكتب بريد ودا حضرتك بتكتب اسمه فى البيانات بتاعتك عشان الكتب توصلك عليه ، أما لو اختارت شحن سريع بيكون التوصيل لحد باب البيت',
                'order' => 4,
                'status' => 'active'
            ],
            [
                'question' => 'اعرف منين أن الكتب وصلت مكتب البريد ؟',
                'answer' => 'احنا لما بنشحن الكتب بيجيلك ايميل من خلاله بتعمل تتبع للشحنة عن طريق باركود بنبعتهولك فى الايميل دا بتنسخه وتضغط على تتبع الشحنة اللي موجودة ف الايميل فا بيحولك على صفحة البريد المصري وتلصق الباركود فى المكان المخصص وبعدها تضغط تتبع الشحنة فا بيجيلك مكان شحنتك بالضبط ، لما بتوصل مكتب البريد اللي كتبت اسمه وانت بتملي الاوردر هما هيتصلوا بيك عشان تستلم أو حضرتك بتروح ببطاقتك الشخصية وتقولهم انك ليك اوردر وعايز تستلمه',
                'order' => 5,
                'status' => 'active'
            ],
            [
                'question' => 'لو فيه مشكلة ف الكتاب وعايز استرد فلوسي ؟',
                'answer' => 'حضرتك بتتواصل معانا وبنوجهك لمسئول الحسابات وهتسترد المبلغ عادي',
                'order' => 6,
                'status' => 'active'
            ],
            [
                'question' => 'هل الكتب اصلية ؟',
                'answer' => 'ايوه يفندم اصلية لأننا معتمدين لدي كل المدرسين الاونلاين',
                'order' => 7,
                'status' => 'active'
            ]
        ];

        foreach ($faqs as $faq) {
            Faq::create($faq);
        }
    }
}
